zhengwang721/ASF/sam/utils/cmsis/sam4e/source/templates/exceptions.h
/**
 * \file
 *
 * \brief This file contains the interface for default exception handlers.
 *
 * Copyright (c) 2012 Atmel Corporation. All rights reserved.
 *
 * \asf_license_start
 *
 * \page License
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice,
 *    this list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form must reproduce the above copyright notice,
 *    this list of conditions and the following disclaimer in the documentation
 *    and/or other materials provided with the distribution.
 *
 * 3. The name of Atmel may not be used to endorse or promote products derived
 *    from this software without specific prior written permission.
 *
 * 4. This software may only be redistributed and used in connection with an
 *    Atmel microcontroller product.
 *
 * THIS SOFTWARE IS PROVIDED BY ATMEL "AS IS" AND ANY EXPRESS OR IMPLIED
 * WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF
 * MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT ARE
 * EXPRESSLY AND SPECIFICALLY DISCLAIMED. IN NO EVENT SHALL ATMEL BE LIABLE FOR
 * ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
 * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS
 * OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT,
 * STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN
 * ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 * \asf_license_stop
 *
 */

#ifndef EXCEPTIONS_H_INCLUDED
#define EXCEPTIONS_H_INCLUDED

#include "sam4e.h"

/* @cond 0 */
/**INDENT-OFF**/
#ifdef __cplusplus
extern "C" {
#endif
/**INDENT-ON**/
/* @endcond */

/* Function prototype for exception table items (interrupt handler). */
typedef void (*IntFunc) (void);

/* Default empty handler */
void Dummy_Handler(void);

void Reset_Handlerz(void);
void NMI_Handlerz(void);
void HardFault_Handlerz(void);
void MemManage_Handlerz(void);
void BusFault_Handlerz(void);
void UsageFault_Handlerz(void);
void SVC_Handlerz(void);
void DebugMon_Handlerz(void);
void PendSV_Handlerz(void);
void SysTick_Handlerz(void);

/* Peripherals handlers */
void SUPC_Handlerz(void);
void RSTC_Handlerz(void);
void RTC_Handlerz(void);
void RTT_Handlerz(void);
void WDT_Handlerz(void);
void PMC_Handlerz(void);
void EFC_Handlerz(void);
void UART0_Handlerz(void);
void SMC_Handlerz(void);
void PIOA_Handlerz(void);
void PIOB_Handlerz(void);
void PIOC_Handlerz(void);
void PIOD_Handlerz(void);
void PIOE_Handlerz(void);
void USART0_Handlerz(void);
void USART1_Handlerz(void);
void HSMCI_Handlerz(void);
void TWI0_Handlerz(void);
void TWI1_Handlerz(void);
void SPI_Handlerz(void);
void DMAC_Handlerz(void);
void TC0_Handlerz(void);
void TC1_Handlerz(void);
void TC2_Handlerz(void);
void TC3_Handlerz(void);
void TC4_Handlerz(void);
void TC5_Handlerz(void);
void TC6_Handlerz(void);
void TC7_Handlerz(void);
void TC8_Handlerz(void);
void AFEC0_Handlerz(void);
void AFEC1_Handlerz(void);
void DACC_Handlerz(void);
void ACC_Handlerz(void);
void ARM_Handlerz(void);
void UDP_Handlerz(void);
void PWM_Handlerz(void);
void CAN0_Handlerz(void);
void CAN1_Handlerz(void);
void AES_Handlerz(void);
void GMAC_Handlerz(void);
void UART1_Handlerz(void);

/* @cond 0 */
/**INDENT-OFF**/
#ifdef __cplusplus
}
#endif
/**INDENT-ON**/
/* @endcond */

#endif /* EXCEPTIONS_H_INCLUDED */
